{
  "backend/main.mo": "Manages project data in a canister, supporting save, fetch, list, and sorting by last updated time.",
  "feature_evidence.json": "Metadata file listing features, related frontend files, components, and test IDs for project tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme color variables and global element styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React app combining header, hero, editor page, footer, and theme provider.",
  "frontend/src/components/BrandHeader.tsx": "Sticky header displaying app branding and logo.",
  "frontend/src/components/editor/ExportPanel.tsx": "UI panel handling video export flow with progress, download, and error states.",
  "frontend/src/components/editor/ProjectBar.tsx": "Toolbar for naming, saving, and opening video editing projects using backend storage.",
  "frontend/src/components/editor/PropertiesPanel.tsx": "UI panel for toggling mute and selecting playback speed, updating editor state.",
  "frontend/src/components/editor/TimelineTrimControls.tsx": "Provides play controls, time slider, and trim in/out adjustments synced to editor state.",
  "frontend/src/components/editor/VideoEditorPage.tsx": "Main editor layout combining file loading, preview, timeline, export, and properties panels.",
  "frontend/src/components/editor/VideoFilePicker.tsx": "Handles video file selection, validates type, extracts duration, and triggers load callback.",
  "frontend/src/components/editor/VideoPreview.tsx": "Video player applying playback settings, enforcing trim range, and syncing time with editor state.",
  "frontend/src/components/HeroSection.tsx": "Landing hero section with marketing text, feature icons, and an illustration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, storage, and status.",
  "frontend/src/hooks/useProjects.ts": "Provides project listing, saving via actor, and helper to open project settings.",
  "frontend/src/hooks/useQueries.ts": "React-query wrappers to list and fetch individual projects using the backend actor.",
  "frontend/src/hooks/useVideoEditorState.ts": "React hook managing video editor state including file, URL, playback, trim, mute, and speed controls with load and restore helpers.",
  "frontend/src/hooks/useVideoExport.ts": "Hook handling video export flow, tracking status, progress, errors, and generating a downloadable output URL.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark themes and global styling.",
  "frontend/src/lib/export/exportTypes.ts": "Defines types for export status, settings, and results used in the video export pipeline.",
  "frontend/src/lib/export/exportVideo.ts": "Implements video export by rendering frames to a canvas, recording them via MediaRecorder, and producing a WebM blob with optional audio.",
  "frontend/src/main.tsx": "Entry point initializing React, query client, identity provider, and global styles before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing project state, features, requirements, and asset needs for the video editor app."
}